{
  "posts": [
    { "id": 1, "title": "Lion", "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Lion_%28Panthera_leo%29_male_6y.jpg/200px-Lion_%28Panthera_leo%29_male_6y.jpg", "date": "01-01-2024", "number": 300, "description": "The lion inhabits grasslands, savannahs and shrublands. It is usually more diurnal than other wild cats, but when persecuted, it adapts to being active at night and at twilight. During the Neolithic period, the lion ranged throughout Africa and Eurasia from Southeast Europe to India, but it has been reduced to fragmented populations in sub-Saharan Africa and one population in western India. It has been listed as Vulnerable on the IUCN Red List since 1996 because populations in African countries have declined by about 43% since the early 1990s. Lion populations are untenable outside designated protected areas. Although the cause of the decline is not fully understood, habitat loss and conflicts with humans are the greatest causes for concern." },
    { "id": 2, "title": "Tiger", "image": "https://files.worldwildlife.org/wwfcmsprod/images/Tiger_resting_Bandhavgarh_National_Park_India/hero_small/6aofsvaglm_Medium_WW226365.jpg", "date": "01-01-2024", "number": 300, "description": "The tiger was first scientifically described in 1758. It once ranged widely from the Eastern Anatolia Region in the west to the Amur River basin in the east, and in the south from the foothills of the Himalayas to Bali in the Sunda Islands. Since the early 20th century, tiger populations have lost at least 93% of their historic range and have been extirpated from Western and Central Asia, the islands of Java and Bali, and in large areas of Southeast and South Asia and China. What remains of the range where tigers still roam free is fragmented, stretching in spots from Siberian temperate forests to subtropical and tropical forests on the Indian subcontinent, Indochina and a single Indonesian island, Sumatra." },
    { "id": 3, "title": "Jaguar", "image": "https://www.livingdesert.org/site/assets/files/4757/jaguar-1.1000x800se.jpg", "date": "01-01-2024", "number": 300, "description": "The modern jaguar's ancestors probably entered the Americas from Eurasia during the Early Pleistocene via the land bridge that once spanned the Bering Strait. Today, the jaguar's range extends from the Southwestern United States across Mexico and much of Central America, the Amazon rainforest and south to Paraguay and northern Argentina. It inhabits a variety of forested and open terrains, but its preferred habitat is tropical and subtropical moist broadleaf forest, wetlands and wooded regions. It is adept at swimming and is largely a solitary, opportunistic, stalk-and-ambush apex predator. As a keystone species, it plays an important role in stabilizing ecosystems and in regulating prey populations." },
    { "id": 4, "title": "Leopard", "image": "https://c02.purpledshub.com/uploads/sites/62/2010/07/GettyImages-160869327-0f0732f.jpg?webp=1&w=1200", "date": "01-01-2024", "number": 300, "description": "The leopard was first described in 1758, and several subspecies were proposed in the 19th and 20th centuries. Today, eight subspecies are recognised in its wide range in Africa and Asia. It initially evolved in Africa during the Early Pleistocene, before migrating into Eurasia around the Early–Middle Pleistocene transition. It was present across Europe, but became extinct in the region at the end of the Late Pleistocene, around 11,000 years ago." },
    { "id": 5, "title": "Cheetah", "image": "https://optimise2.assets-servd.host/maniacal-finch/production/animals/cheetah-01-01.jpg?w=1200&auto=compress%2Cformat&fit=crop&dm=1658942789&s=0c0a3530fe9287abce8139ca9b24cb18", "date": "01-01-2024", "number": 300, "description": "The cheetah was first described in the late 18th century. Four subspecies are recognised today that are native to Africa and central Iran. An African subspecies was introduced to India in 2022. It is now distributed mainly in small, fragmented populations in northwestern, eastern and southern Africa and central Iran. It lives in a variety of habitats such as savannahs in the Serengeti, arid mountain ranges in the Sahara, and hilly desert terrain." },
    { "id": 6, "title": "Cougar", "image": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Mountain_Lion_in_Glacier_National_Park.jpg", "date": "01-01-2024", "number": 300, "description": "The cougar is largely solitary by nature and considered both nocturnal and crepuscular, although daytime sightings do occur. It is an ambush predator that pursues a wide variety of prey. Primary food sources are ungulates, particularly deer, but it also hunts smaller prey, such as rodents. Cougars are territorial and live at low population densities. Individual home ranges depend on terrain, vegetation and abundance of prey. While large, it is not always the apex predator in its range, yielding prey it has killed to American black bears, grizzly bears, and wolf packs. It is reclusive and mostly avoids people. Fatal attacks on humans are rare but increased in North America as more people entered cougar habitat and built farms." }
  ],
  "comments": [
    { "id": 1, "body": "some comment", "postId": 1 },
    { "id": 2, "body": "some comment", "postId": 1 }
  ],
  "profile": {
    "name": "typicode"
  }
}
